# St7SetCreepDefinitionName

Sets the name of the specified creep law definition.

long St7SetCreepDefinitionName(long uID, long CreepID, char* CreepDefinitionName)

Input Parameters

uID

Strand7 model file ID.

CreepID

Creep layout ID.

CreepDefinitionName

Name of the creep definition.